# Perp

## Description
Returns a vector which is perpendicular to the specified vector. The resultant vector will have the same magnitude as the source vector, and their scalar product will be zero. The direction of the return vector will equal Vec2Ang(Vec) - 90.

```pascal
FUNCTION Perp(Vec : VECTOR) : VECTOR;
```

```python

def vs.Perp(Vec):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|Vec|VECTOR|Source vector.|

## Returns
Returns a VECTOR.

## Version
Availability: from MiniCAD
## Category
* Math - Vectors